<a href="https://colab.research.google.com/github/RaviSiddu/basics/blob/master/pandas_basics_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [142]:
import pandas as pd
import numpy as np
birds=pd.DataFrame({
    "birds":['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
    "age":[3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4], 
    "visits": [2, 4, 3, 4, 3, 4, 2, 2, 3, 2], 
    "priority": ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no'],
    "labels":['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
 
     
})
birds.set_index('labels',inplace=True)
birds

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [30]:
birds.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [33]:
birds[:2]

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
b       Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [105]:
birds_2c=birds[['birds','age']]
birds_2c

          birds  age
labels
a        Cranes  3.5
c       plovers  1.5
f        Cranes  3.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [110]:
birds.iloc[[2,3,7], [0,1,2]]

             birds  age  visits
labels
c          plovers  1.5       3
d       spoonbills  NaN       4
h           Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [52]:
birds_visits=birds[birds['visits'] < 4] 
birds_visits

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [62]:
bi=birds[birds['age'].isnull()]
bi[['birds','visits']]

             birds  visits
labels
d       spoonbills       4
h           Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [153]:
birds[(birds['birds'] == 'Cranes') & (birds['age'] < 4)]

         birds  age  visits  priority
labels
a       Cranes  3.5       2         1
f       Cranes  3.0       4         0

**9. Select the rows the age is between 2 and 4(inclusive)**

In [152]:
birds[(birds['age'] >= 2) & (birds['age'] <= 4)]

             birds  age  visits  priority
labels
a           Cranes  3.5       2         1
b           Cranes  4.0       4         1
f           Cranes  3.0       4         0
j       spoonbills  4.0       2         0

**10. Find the total number of visits of the bird Cranes**

In [151]:
birds[(birds['birds'] == 'Cranes') & (birds['visits'] > 0)].sum()

birds       CranesCranesCranesCranes
age                             10.5
visits                            12
priority                           3
dtype: object

**11. Calculate the mean age for each different birds in dataframe.**

In [79]:
print("\nMean age for each different birds in data frame:")
print(birds['age'].mean())

Mean age for each different birds in data frame:
2.6666666666666665

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [150]:
import pandas as pd
import numpy as np
birds1=pd.DataFrame({
    "birds":[ 'dog'],
    "age":[4], 
    "visits": [3], 
    "priority": ['yes'],
    "labels":['k']
     
})
birds1.set_index('labels',inplace=True)
birds.append(birds1)

             birds  age  visits priority
labels
a           Cranes  3.5       2        1
b           Cranes  4.0       4        1
c          plovers  1.5       3        0
d       spoonbills  NaN       4        1
e       spoonbills  6.0       3        0
f           Cranes  3.0       4        0
g          plovers  5.5       2        0
h           Cranes  NaN       2        1
i       spoonbills  8.0       3        0
j       spoonbills  4.0       2        0
k              dog  4.0       3      yes

**13. Find the number of each type of birds in dataframe (Counts)**

In [144]:
birds.groupby(birds["birds"]).count()

            birds  age  visits  priority
birds
Cranes          4    3       4         4
plovers         2    2       2         2
spoonbills      4    3       4         4

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [147]:

sort_by_age = birds.sort_values('age',ascending=False)
print(sort_by_age.head())
print("------------------------------------")
sort_by_vists = birds.sort_values('visits',ascending=True)
print(sort_by_vists.head())

             birds  age  visits  priority
labels
i       spoonbills  8.0       3         0
e       spoonbills  6.0       3         0
g          plovers  5.5       2         0
b           Cranes  4.0       4         1
j       spoonbills  4.0       2         0
------------------------------------
             birds  age  visits  priority
labels
a           Cranes  3.5       2         1
g          plovers  5.5       2         0
h           Cranes  NaN       2         1
j       spoonbills  4.0       2         0
c          plovers  1.5       3         0

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [143]:
birds['priority'] = birds['priority'].map({'yes': 1, 'no': 0})
print(birds)

             birds  age  visits  priority
labels
a           Cranes  3.5       2         1
b           Cranes  4.0       4         1
c          plovers  1.5       3         0
d       spoonbills  NaN       4         1
e       spoonbills  6.0       3         0
f           Cranes  3.0       4         0
g          plovers  5.5       2         0
h           Cranes  NaN       2         1
i       spoonbills  8.0       3         0
j       spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [145]:
birds.birds.map(lambda name: 'trumpeters' if name=='Cranes' else name)

labels
a    trumpeters
b    trumpeters
c       plovers
d    spoonbills
e    spoonbills
f    trumpeters
g       plovers
h    trumpeters
i    spoonbills
j    spoonbills
Name: birds, dtype: object